# taps
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"

# formulae (CLI tools & libs)
brew "git"
brew "gh"
brew "act"                   # run GitHub Actions locally :contentReference[oaicite:0]{index=0}
brew "nvm"
brew "pyenv"
brew "kubernetes-cli"        # kubectl :contentReference[oaicite:1]{index=1}
brew "awscli"                # AWS CLI v2 :contentReference[oaicite:2]{index=2}
brew "go"                    # latest Go
brew "rustup-init"           # Rust toolchain installer
brew "jenv"                  # Java version manager
brew "z"                     # directory-jumper utility :contentReference[oaicite:3]{index=3}
brew "terraform"
brew "lazygit"               # TUI for Git :contentReference[oaicite:4]{index=4}
brew "neovim"
brew "mysql"

# casks (GUI apps)
cask "xcode"                 # triggers App Store download
cask "android-studio"
cask "iterm2"
cask "visual-studio-code"
cask "postman"
cask "lm-studio"             # local LLM runner :contentReference[oaicite:5]{index=5}

